#include <stdio.h>
#include <map>
#include <unordered_map>
using namespace std;

int main() {
	//1.按位与
	6 & 3;  // 结果是 2
		// 6 = 110（二进制）
		// 3 = 011
		// & = 010（二进制）= 2

	//常用：取某一位
	int x = 6; // 110
	int bit0 = x & 1; // 取最低位 = 0

	//2.按位或
	6 | 3;  // 结果是 7
		// 6 = 110
		// 3 = 011
		// | = 111 = 7


	//3.按位异或
	6 ^ 3;  // 结果是 5
		// 6 = 110
		// 3 = 011
		// ^ = 101 = 5

	//4.按位取反
	~6;
		// 6 = 000000...0110
		// ~ = 111111...1001 （负数，用补码表示）
	

	//5.左移，低位补0，左移一次相当于乘以2
	3 << 2;  // 结果是 12
		// 3 = 000...0011
		// <<2 = 000...1100 = 12

	//6.右移，高位补符号位。右移一次相当于除以2
	12 >> 2  // 结果是 3
		// 12 = 000...1100
		// >>2 = 000...0011 = 3













}